# Зчитуємо n від користувача
n = int(input("Введіть число n: "))

# Створюємо пустий список для зберігання простих чисел
prime_numbers = []

# Перевіряємо кожне число у діапазоні від 2 до n на простоту
for num in range(2, n + 1):
    is_prime = True
    # Перевіряємо, чи є поточне число num простим
    for i in range(2, num):
        if num % i == 0:
            # Якщо число num ділиться без остачі на інше число, то воно не є простим
            is_prime = False
            break
    # Якщо число просте, додаємо його до списку простих чисел
    if is_prime:
        prime_numbers.append(num)

# Виводимо знайдені прості числа
print("Прості числа у діапазоні від 2 до", n, ":", prime_numbers)
