#Прості числа - це натуральні числа, які більше за 1 і мають лише два дільники: 1 і саме число.
# Зчитуємо n від користувача
n = int(input("Введіть число n: "))

# Ініціалізуємо флаг простоти числа
is_prime = True

# Перевіряємо кожне число у діапазоні від 2 до n на простоту
for num in range(2, n):
    if n % num == 0:
        # Якщо число n ділиться без остачі на яке-небудь інше число у діапазоні, воно не є простим
        is_prime = False
#        break

# Виводимо відповідне повідомлення про простоту числа n
if is_prime:
    print(n, "is prime number")
else:
    print(n, "is not prime number")
